// 冒泡排序。
// 比较相邻的元素。如果第一个比第二个大，就交换他们两个。
// 对每一对相邻元素作同样的工作，从头到尾，最后的元素应该会是最大的数。
// 针对所有的元素重复以上的步骤，除了最后一个。
// 持续每次对越来越少的元素重复上面的步骤，直到没有任何一对数字需要比较。
// 编程思路：外循环控制需要比较的元素，比如第一次排序后，最后一个元素就不需要比较了，内循环则负责两两元素比较，将元素放到正确位置上
// 时间复杂度O(n^2),空间复杂度O(1)
function bubbleSort(arr) {
  var len = arr.length - 1;
  for(let i = 0; i < len; i++) {
    for(let j = 0; j < len - i; j++) {
      if(arr[j] > arr[j+1]) {
        [arr[j], arr[j+1]] = [arr[j+1], arr[j]]
      }
    }
  }
  return arr
}

a = [1,4,6,8,32,9,34,78,3,54];
console.log(bubbleSort(a));




